<?php

//$day = 7; //date("w");//4
//
//if($day > 0 && $day < 6){
//    echo "Будний день";
//}
//elseif($day == 6 || $day == 0){
//    echo "Выходной день";
//}
//else{
//    echo "День указан некорректно!";
//}

//$x = 10;
//$check = true;
//
//if($x >= 10){
//    ++$x;
//    if($x<11){
//        $x++;
//    }
//    else{
//        if(0){
//            if("test"){
//                $x *= 2;
//            }
//            $x += 2;
//        }
//        if($check){
//            $x += 10;
//        }
//        else{
//            $x++;
//        }
//    }
//}
//echo $x++;

$day = date("w");

if($day > 0 && $day < 6):?>
   <h1>День №<?= $day?> - будний день</h1>
<?php

else:?>
    <h1>День №<?= $day?> - выходной день</h1>
<?php
endif;
?>
    






























