<?php
$a = rand(-5, 5);
$b = rand(-5, 5);

if ($a >= 0 && $b >= 0) {
    echo 'а= ' . $a . '<br>';
    echo 'b= ' . $b . '<br>';
    $a = $a - $b;
    echo 'Числа положительные, их разность: ' . $c;
} elseif ($a < 0 && $b < 0) {
    echo 'а= ' . $a . '<br>';
    echo 'b= ' . $b . '<br>';
    $a = $a * $b;
    echo 'Числа отрицательные, их произведение: ' . $a;
} else {
    echo 'а= ' . $a . '<br>';
    echo 'b= ' . $b . '<br>';
    $a = $a + $b;
    echo 'Числа с разными знаками, их сумма: ' . $a;
}
